package org.sbas.constants

enum class EgenCmMid {
    Z000, Y009, Y008, Y007, Y006, Y005, Y004, Y003, Y002, Y001, Y000,
    SIDO, S000, P004, P003, P002, P001, O000, N000, M000, L000,
    J004, J003, J002, J001, J000,
    H050, H040, H030, H020, H010, H000,
    D001, D000, AMBL, AED2, AED1, AED0,
    L, K, J, I, H, G, F, E, D, C, B, A,
}
/*
Z000[정보센터]
Y009[중증이용_연락번호구분]
Y008[중증이용_전원처리결과]
Y007[중증이용_의뢰경로]
Y006[중증이용_통화자_구분]
Y005[중증이용_부정확사유]
Y004[중증이용_수용사유]
Y003[중증이용_미수용사유]
Y002[질환별정보상태]
Y001[점검]
Y000[증상]
SIDO[지역코드]
S000[특수클리닉및센터]
P004[시도]
P003[진료과목]
P002[영업구분]
P001[의료기관구분]
O000[의료자원(실시간)]
N000[의료자원(필수)]
M000[중증응급실질환]
L000[지역별링크정보]
J004[지역보건소]
J003[일반의약업]
J002[응급의료기관]
J001[1339]
J000[직종]
H050[전문의구분]
H040[운영상태]
H030[응급의료기관구분]
H020[의료기관구분]
H010[설립구분]
H000[기관구분]
D001[중증질환_핫라인]
D000[진료과목]
AMBL[기도[1**]/호흡[2**]/순환[3**]/약품{4**}/고정[5**]/기타[6**]]
AED2[공동주택]
AED1[다중이용시설]
AED0[구비의무기관]
L[경상남도 시군구]
K[전라북도 시군구]
J[강원도 시군구]
I[강원도 시군구]
H[경기도 시군구]
G[경기도 시군구]
F[인천광역시 시군구]
E[대전광역시 시군구/충청북도 시군구]
D[광주광역시 시군구/전라남도 시군구]
C[대구광역시 시군구/경상북도 시군구]
B[부상광역시 시군구/울산광역 시시군구]
A[서울특별시 시군구/제주시 시군구]
*/